In [8]:
import pandas as pd
import numpy as np

In [16]:
data = [[9, 'Hercy', None, 43], [6, 'Alice', 9, 41], [4, 'Bob', 9, 36], [2, 'Winston', None, 37]]
employees = pd.DataFrame(data, columns=['employee_id', 'name', 'reports_to', 'age']).astype({'employee_id':'Int64', 'name':'object', 'reports_to':'Int64', 'age':'Int64'})

In [17]:
employees

   employee_id     name  reports_to  age
0            9    Hercy        <NA>   43
1            6    Alice           9   41
2            4      Bob           9   36
3            2  Winston        <NA>   37

In [18]:
result = employees.groupby('reports_to').agg(
        reports_count=('employee_id', 'size'),
        average_age=('age', 'mean')).reset_index()
result

   reports_to  reports_count  average_age
0           9              2         38.5

In [19]:
result["average_age"] = result["average_age"].apply(lambda x: int(np.floor(x + 0.5)))

In [20]:
result

   reports_to  reports_count  average_age
0           9              2           39

In [21]:
result = result.merge(employees, left_on='reports_to', right_on='employee_id', how='inner')
result

,reports_to_x,reports_count,average_age,employee_id,name,reports_to_y,age
0,9,2,39,9,Hercy,<NA>,43

In [24]:
result[['employee_id', 'name', 'reports_count', 'average_age']].sort_values(by="employee_id")

   employee_id   name  reports_count  average_age
0            9  Hercy              2           39